----------------------------------- member --------------------------------------  

-- 멤버 삭제
delete member where m_id='home1';

---------------------------------- cart --------------------------------------

-- 특정 멤버 장바구니 비우기 
delete cart where m_id = 'home1';

-- 장바구니 상품 하나 삭제 
delete cart where c_no = '5';

---------------------------------- wishlist --------------------------------------

-- 위시리스트 상품 하나 삭제 
delete wishlist where w_no = 9; 

-- 특정 멤버 위시리스트 비우기 
delete wishlist where m_id = 'home3';

-------------------------- order --------------------------------------

-- 특정 멤버의 주문 전체 삭제 
delete orders where m_id = 'home1';

-- 특정 주문 삭제 
delete orders where o_no = 4;

------------------------ QNA----------------------------------

-- 게시글 삭제 
delete qna where q_no = 1;

------------------------ review ----------------------------------

-- 리뷰 삭제 
delete review where r_no=?
